OLTP - Online Transaction Processing
거래를 위한 데이터베이스로 보류, 중간이 없는 무결한 상태이다.
sql로 데이터를 추출할 수 있지만 분석을 위한 데이터베이스가 아니기 때문에 쿼리 속도가 느릴 수 있다.

SQL - 데이터베이스에서 데이터를 관리하기 위해 설계된 특수목적의 언어

빅쿼리 -> OLAP - 속도 빠름 / 구글에서 인프라를 관리하기 때문에 서버를 띄울 필요 없음

빅쿼리
1) 프로젝트 - 하나의 프로젝트 안에 여러 데이터셋 존재
2) 데이터셋 - 프로젝트에 있는 창고 - 별도의 데이터 다양하게 저장 가능
3) 테이블 - 상품의 세부 정보 저장, 행과 열로 이루어진 데이터들이 저장

2-1
포켓몬을 활용한 SQL
기본 문법
select
from
where

데이터가 어떻게 저장되어있는지 알아야한다 (ERD 활용)
- 어떤 테이블, 어떤 컬럼이 존재하는가?
- 테이블 사이 연결에 어떤 컬럼을 사용하는가?
- 컬럼의 값은 어떤 의미를 가지는가?
